In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"groups": ["a", "b", "c", "a", "b", "c"],
                   "var1": [1,5,2,8,0,4],
                   "var2": [4,3,6,8,3,2]})

In [3]:
df

  groups  var1  var2
0      a     1     4
1      b     5     3
2      c     2     6
3      a     8     8
4      b     0     3
5      c     4     2

In [6]:
def func_filter(x):
    return x["var1"].std() > 2

In [8]:
df.groupby("groups").std()

            var1      var2
groups
a       4.949747  2.828427
b       3.535534  0.000000
c       1.414214  2.828427

In [7]:
df.groupby("groups").filter(func_filter)

  groups  var1  var2
0      a     1     4
1      b     5     3
3      a     8     8
4      b     0     3